In [20]:
import pandas as pd

In [21]:
import sqlite3

In [22]:
con = sqlite3.connect("database.sqlite")

Return name with highest count:

In [23]:
df = pd.read_sql_query("""

    SELECT Name, SUM(Count) as TotalCount
    FROM NationalNames
    GROUP BY Name
    ORDER BY TotalCount DESC
    LIMIT 1

""", con)
df

    Name  TotalCount
0  James     5129096

Return name with second highest count (must be robust to ties!)

In [24]:
df = pd.read_sql_query("""

WITH subquery AS(
    SELECT Name, SUM(Count) as TotalCount
    FROM NationalNames
    GROUP BY Name
    ORDER BY TotalCount DESC
    )

SELECT * 
FROM subquery
WHERE TotalCount < (
    SELECT MAX(TotalCount)
    FROM subquery
)
LIMIT 1
    
""", con)
df

   Name  TotalCount
0  John     5106590

Return most common female name

In [25]:
df = pd.read_sql_query("""

    SELECT Name, SUM(Count) as TotalCount
    FROM NationalNames
    WHERE Gender = "F"
    GROUP BY Name
    ORDER BY TotalCount DESC
    LIMIT 1

""", con)
df

   Name  TotalCount
0  Mary     4115282

Return second most common female name

In [26]:
df = pd.read_sql_query("""

WITH subquery AS(
    SELECT Name, SUM(Count) as TotalCount
    FROM NationalNames
    WHERE Gender = "F"
    GROUP BY Name
    ORDER BY TotalCount DESC
    )

SELECT Name,TotalCount
FROM subquery 
WHERE TotalCount < (
    SELECT subquery.TotalCount
    FROM subquery
    LIMIT 1
)
LIMIT 1
    
""", con)
df

        Name  TotalCount
0  Elizabeth     1601128

Return most common female name between the years of 1992 - 1997

In [27]:
df = pd.read_sql_query("""

    SELECT Name, SUM(Count) as TotalCount
    FROM NationalNames
    WHERE (Gender = "F") AND (Year BETWEEN 1992 and 1997)
    GROUP BY Name
    ORDER BY TotalCount DESC
    LIMIT 1
    
""", con)
df

      Name  TotalCount
0  Jessica      178623

Return second most common female name between the years of 1992 - 1997

In [28]:
df = pd.read_sql_query("""

WITH subquery AS(
    SELECT Name, SUM(Count) as TotalCount
    FROM NationalNames
    WHERE (Gender = "F") AND (Year BETWEEN 1992 and 1997)
    GROUP BY Name
    ORDER BY TotalCount DESC
    )

SELECT Name,TotalCount
FROM subquery
WHERE TotalCount < (
    SELECT subquery.TotalCount
    FROM subquery
    LIMIT 1
)
LIMIT 1
    
""", con)
df

     Name  TotalCount
0  Ashley      174748